'''
2021.10.28
[이것이 코딩테스트다] p.217 1로 만들기
정수 X가 주어질 때 정수 X에 사용할 수 있는 연산은 다음과 같다
a. X가 5로 나누어떨어지면, 5로 나눈다.
b. X가 3로 나누어떨어지면, 3로 나눈다.
c. X가 2로 나누어떨어지면, 5로 나눈다.
d. X에서 1을 뺀다.
연산 4개를 적절히 이용해서 1을 만들려고 한다. 연산을 사용하는 횟수의 최솟값을 출력하시오.
<입력예시> <출력 예시>
26       3
'''
# 나의 답
n = 26
r = 0

while True:
    if n == 0:
        break
    if n & 5 == 0:
        n = n // 5
        r += 1
        print('--1', n, r)
    elif n & 3 == 0:
        n = n // 3
        r += 1
        print('--2', n, r)
    elif n & 2 == 0:
        n = n // 2
        r += 1
        print('--3', n, r)
    else:
        n = n - 1
        r += 1
        print('--4', n, r)
        
print(r)

# 해설
x = int(input())

# 앞서 계산된 결과를 저장하기 위한 DP 테이블 초기화
d = [0] * 30001

# 다이나믹 프로그래밍 진행(보텀업)
for i in range(2,  x+1):
    # 현재의 수에서 1을빼는 경우
    d[i] = d[i - 1] + 1
    # 현재의 수가 2로 나누어 떨어지는 경우
    if i % 2 == 0:
        d[i] = min(d[i], d[i//2]+1)
    # 현재의 수가 3로 나누어 떨어지는 경우
    if i % 3 == 0:
        d[i] = min(d[i], d[i//3]+1) 
    # 현재의 수가 2로 나누어 떨어지는 경우
    if i % 5 == 0:
        d[i] = min(d[i], d[i//5]+1)

print(d[x])

